eamodio.gitlens
evilcat.norminette-42
fill-labs.dependi
formulahendry.code-runner
franneck94.c-cpp-runner
github.codespaces
github.copilot
github.copilot-chat
golang.go
keyhr.42-c-format
kube.42header
mariusvanwijk-joppekoers.codam-norminette-3
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
qwtel.sqlite-viewer
rust-lang.rust-analyzer
s-nlf-fh.glassit
tamasfe.even-better-toml
tonybaloney.vscode-pets
twxs.cmake
vadimcn.vscode-lldb
vscodevim.vim
